// 1-e задание
console.log("1-e задание: сравнить значения");
let a = 31.232;
let b = 31.231;
if (a > b) {console.log('Значение "а"=' + a + ' больше, чем "b"=' + b)}
    else { if (a < b) {console.log('Значение "b"=' + b + ' больше, чем "a"=' + a)}
        else {console.log ('Значения равны между собой')}; 
    }
//_______________________________________________________


// 2-e задание
console.log("2-e задание: вывести квадраты чисел от 0 до 100 на цикле 'for'");
for (i=0; i<100; i++) {
    console.log(i*i); // или console.log(Math.pow(i, 2));
}
//_______________________________________________________

// 3-e задание
console.log("3-e задание: вывести квадраты чисел от 0 до 100 на цикле 'while'");
let j = 0;
while (j < 100) {
    console.log(j*j);
    j++;
}
//_______________________________________________________

// 3.1-e задание
console.log("3.1-e задание: вывести квадраты чисел от 0 до 100 на цикле 'do-while'");
let k = 0;
do {
    console.log(k*k);
    k++
} while (k < 100);
//_______________________________________________________
